programming/book/php_objects_patterns_and_practice.org
#+setupfile: ../../styles/readtheorg.setup
#+title: PHP Objects, Patterns and Practice

* PHP and Objects
** The Accidental Success of PHP Objects

OO design often uses a method declaration as a kind of contract. The method demands certain inputs and, reciprocally, promises to give a particular type of data back.

** Advocacy and Agnosticism: The Object Debate

One can create perfectly acceptable working systems using functions and global code. "There's more than one way to do it." This is especially true of smaller scripts, where quickly getting a working example up and running is more important than building a structure that will scale well into a larger system (scratch projects of this sort are often known as "spikes"). The trick is to know when the quick proof of concept is becoming the root of a larger development, and to call a halt before lasting design decisions are made by the sheer weight of code.

It is becoming increasingly hard to work as a PHP programmer without using and understanding PHP's support for objects, not least because the third party libraries used in projects will themselves likely be object-oriented.

* Object Basics
** Arguments and Types
*** Primitive Types

It is better to provide a clear and strict interface for a method or function than it is to offer a fuzzily forgiving one. Fuzzy and forgiving functions and methods can promote confusion and thereby breed bugs.

Type matters. The fact that PHP is loosely typed makes it all the more important. One cannot rely on a compiler to prevent type-related bugs. Consider the potential impact of unexpected types when they find their way into the arguments. Don't trust client coders to read your thoughts, and always consider how the methods will deal with incoming garbage.

*** Object Types

When you define a class, you also define a type, but a type can describe an entire family of classes.

** Inheritance
*** The Inheritance Problem

A complex function/class that needs to differentiate various conditions can be separated into different functions/classes. Then the complexity issue is addressed at a cost, which is duplication. By making child classes inherit from common parent class, duplication can be minimized.

*** Working with Inheritance

Super class's implementation of a method might seem redundant if it is overridden by all children. Nevertheless, it provides basic functionality that new child classes might use. Its presence also provides a guarantee to client code that all children objects will provide this method. It is possible to make this promise in a base class without providing any implementation at all, by using abstract method or interface.

* Advanced Features
** Static Methods and Properties

Methods like this act as "factories" in that they take raw materials (row data or configuration information) and use them to produce objects. The term *factory* is applied to code designed to generate object instances.

It is not good practice for a parent class to have intimate knowledge of its children.  Problems of this kind - where to acquire key objects and values and how much classes should know about one another - are very common in object-oriented programming.
** Traits
*** Defining and Using a Trait

One of the core object-oriented design goals is the removal of duplication. One solution to this kind of duplication is to factor it out into a reusable strategy class. Traits provide another approach - less elegant, perhaps, but certainly effective.
** Late Static Bindings

 A static method can be used as factory, a way of generating instances of the containing class. Why use a static factory method when a constructor performs the work of creating an object already? Because of a pattern called Identity Map. An Identity Map component generates and manages a new object only if an object with the same distinguishing characteristics is not already under management. If the target object already exists, it is returned. A factory method like =create()= would make a good client for a component of this sort.
** Handling Errors

Testing for error conditions is relatively trivial, but it must be decided how to respond to them should they arise. Methods that detect errors usually do not have the information to decide how to handle them. Some options:

1. End execution.
   - Have to take responsibility for bringing an entire script crashing down.
2. Return an error flag, e.g. a boolean or an integer value of 0 or -1.
   - Return value is polluted.
   - Have to rely on the client code to test for the return type. There is no guarantee that the client will be any better equipped to decide how to handle the error.
