programming/book/php_objects_patterns_and_practice.html
---
title: "PHP Objects, Patterns and Practice"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PHP Objects, Patterns and Practice</title>
<!-- 2017-09-16 Sat 19:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>





</head>
<body>
<div id="content">
<h1 class="title">PHP Objects, Patterns and Practice</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. PHP and Objects</a>
<ul>
<li><a href="#sec-1-1">1.1. The Accidental Success of PHP Objects</a></li>
<li><a href="#sec-1-2">1.2. Advocacy and Agnosticism: The Object Debate</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Object Basics</a>
<ul>
<li><a href="#sec-2-1">2.1. Arguments and Types</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Primitive Types</a></li>
<li><a href="#sec-2-1-2">2.1.2. Object Types</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Inheritance</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. The Inheritance Problem</a></li>
<li><a href="#sec-2-2-2">2.2.2. Working with Inheritance</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Advanced Features</a>
<ul>
<li><a href="#sec-3-1">3.1. Static Methods and Properties</a></li>
<li><a href="#sec-3-2">3.2. Traits</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Defining and Using a Trait</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Late Static Bindings</a></li>
<li><a href="#sec-3-4">3.4. Handling Errors</a></li>
<li><a href="#sec-3-5">3.5. Working with Interceptors</a></li>
<li><a href="#sec-3-6">3.6. Callbacks, Anonymous Functions, and Closures</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Object Tools</a>
<ul>
<li><a href="#sec-4-1">4.1. PHP and Packages</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. PHP Packages and Namespaces</a></li>
<li><a href="#sec-4-1-2">4.1.2. Include Paths</a></li>
<li><a href="#sec-4-1-3">4.1.3. Autoload</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. The Class and Object Functions</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Objects and Design</a>
<ul>
<li><a href="#sec-5-1">5.1. Object-Oriented and Procedural Programming</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. Responsibility</a></li>
<li><a href="#sec-5-1-2">5.1.2. Cohesion</a></li>
<li><a href="#sec-5-1-3">5.1.3. Coupling</a></li>
<li><a href="#sec-5-1-4">5.1.4. Orthogonality</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. Choosing Your Classes</a></li>
<li><a href="#sec-5-3">5.3. Polymorphism</a></li>
<li><a href="#sec-5-4">5.4. Encapsulation</a></li>
<li><a href="#sec-5-5">5.5. Forget How to Do It</a></li>
<li><a href="#sec-5-6">5.6. Four Signposts</a>
<ul>
<li><a href="#sec-5-6-1">5.6.1. Code Duplication</a></li>
<li><a href="#sec-5-6-2">5.6.2. The Class Who Knew Too Much</a></li>
</ul>
</li>
<li><a href="#sec-5-7">5.7. The UML [Skipped]</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> PHP and Objects</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> The Accidental Success of PHP Objects</h3>
<div class="outline-text-3" id="text-1-1">
<p>
OO design often uses a method declaration as a kind of contract. The method demands certain inputs and, reciprocally, promises to give a particular type of data back.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Advocacy and Agnosticism: The Object Debate</h3>
<div class="outline-text-3" id="text-1-2">
<p>
One can create perfectly acceptable working systems using functions and global code. "There's more than one way to do it." This is especially true of smaller scripts, where quickly getting a working example up and running is more important than building a structure that will scale well into a larger system (scratch projects of this sort are often known as "spikes"). The trick is to know when the quick proof of concept is becoming the root of a larger development, and to call a halt before lasting design decisions are made by the sheer weight of code.
</p>

<p>
It is becoming increasingly hard to work as a PHP programmer without using and understanding PHP's support for objects, not least because the third party libraries used in projects will themselves likely be object-oriented.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Object Basics</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Arguments and Types</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Primitive Types</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
It is better to provide a clear and strict interface for a method or function than it is to offer a fuzzily forgiving one. Fuzzy and forgiving functions and methods can promote confusion and thereby breed bugs.
</p>

<p>
Type matters. The fact that PHP is loosely typed makes it all the more important. One cannot rely on a compiler to prevent type-related bugs. Consider the potential impact of unexpected types when they find their way into the arguments. Don't trust client coders to read your thoughts, and always consider how the methods will deal with incoming garbage.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Object Types</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
When you define a class, you also define a type, but a type can describe an entire family of classes.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Inheritance</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> The Inheritance Problem</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
A complex function/class that needs to differentiate various conditions can be separated into different functions/classes. Then the complexity issue is addressed at a cost, which is duplication. By making child classes inherit from common parent class, duplication can be minimized.
</p>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Working with Inheritance</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Super class's implementation of a method might seem redundant if it is overridden by all children. Nevertheless, it provides basic functionality that new child classes might use. Its presence also provides a guarantee to client code that all children objects will provide this method. It is possible to make this promise in a base class without providing any implementation at all, by using abstract method or interface.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Advanced Features</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Static Methods and Properties</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Methods like this act as "factories" in that they take raw materials (row data or configuration information) and use them to produce objects. The term <b>factory</b> is applied to code designed to generate object instances.
</p>

<p>
It is not good practice for a parent class to have intimate knowledge of its children.  Problems of this kind - where to acquire key objects and values and how much classes should know about one another - are very common in object-oriented programming.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Traits</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Defining and Using a Trait</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
One of the core object-oriented design goals is the removal of duplication. One solution to this kind of duplication is to factor it out into a reusable strategy class. Traits provide another approach - less elegant, perhaps, but certainly effective.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Late Static Bindings</h3>
<div class="outline-text-3" id="text-3-3">
<p>
A static method can be used as factory, a way of generating instances of the containing class. Why use a static factory method when a constructor performs the work of creating an object already? Because of a pattern called Identity Map. An Identity Map component generates and manages a new object only if an object with the same distinguishing characteristics is not already under management. If the target object already exists, it is returned. A factory method like <code>create()</code> would make a good client for a component of this sort.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Handling Errors</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Testing for error conditions is relatively trivial, but it must be decided how to respond to them should they arise. Methods that detect errors usually do not have the information to decide how to handle them. Some options:
</p>

<ol class="org-ol">
<li>End execution.
<ul class="org-ul">
<li>Have to take responsibility for bringing an entire script crashing down.
</li>
</ul>
</li>
<li>Return an error flag, e.g. a boolean or an integer value of 0 or -1.
<ul class="org-ul">
<li>Return value is polluted.
</li>
<li>Have to rely on the client code to test for the return type. There is no guarantee that the client will be any better equipped to decide how to handle the error.
</li>
</ul>
</li>
</ol>
</div>
</div>
