programming/book/php_objects_patterns_and_practice.org
** Working with Interceptors

=__call()= method can be useful for delegation - the mechanism by which one object passes method invocations on to a second. With inheritance the relationship between child and parent is fixed, the ability to switch the receiving object at runtime means that _delegation can be more flexible than inheritance_.

#+begin_src php
class Person {
    private $writer;
    public function __construct(PersonWriter $writer) {
        $this->writer = $writer;
    }
    public function __call(string $method, array $args) {
        if (method_exists($this->writer, $method)) {
            $this->writer->$method($this); // Delegate to writer
        }
    }
    public function getName(): string {
        return 'Foo Bar';
    }
}

class PersonWriter {
    public function writeName(Person $person) {
        echo 'Name: ' . $person->getName() . "\n";
    }
}

$writer = new PersonWriter();
$person = new Person($writer);
$person->writeName();
#+end_src

Although automated delegation can save a lot of legwork, there can be a cost in clarity. Rely too much on delegation, you present the world with a dynamic interface that resists reflection. The logic that governs the interaction between a delegating class and its target can be obscure - buried in methods like =__call()= rather than signaled up front by inheritance relationships or method type hints.

=__get()= and =__set()= interceptor methods can also be used to manage composite properties.

#+begin_src php
<?php
class Person {
    private $firstName;
    private $lastName;
    public function __construct(string $maybeFirst, string $maybeLast = null) {
        if ($maybeLast === null) {
            $this->fullName = $maybeFirst;
        } else {
            $this->firstName = $maybeFirst;
            $this->lastName = $maybeLast;
        }
    }
    public function __set(string $property, string $value) {
        if ($property === 'fullName') {
            $name = explode(' ', $value);
            if (count($name) > 1) {
                $this->firstName = array_shift($name);
                $this->lastName = implode(' ', $name);
            } else {
                throw new Exception('Wrong name:' . $value);   
            }
        }
    }
    public function __get(string $property) {
        if ($property === 'fullName') {
            return $this->firstName . ' ' . $this->lastName;
        }
    }
}

$a = new Person('Foo', 'Bar');
echo $a->fullName;
$b = new Person('Foo Bar');
echo $b->fullName;
#+end_src
** Callbacks, Anonymous Functions, and Closures

Adding many incidental tasks to a method will overwhelm its core responsibility. Callbacks allow plugging functionality into a component at runtime that is not directly related to that component's core task. By making a component callback aware, client code will have the power to extend core code in contexts you don't yet know about.

#+begin_src php
class Item {}

class Processor {
    private $callbacks;
    // Register callbacks
    public function registerCallback(callable $callback) {
        if (!is_callable($callback)) {
            throw new Exception('Callback is not callable');
        }
        $this->callbacks[] = $callback;
    }
    public function process(Item $item) {
        echo 'Processing ...';
        // Invoke callbacks
        foreach ($this->callbacks as $callback) {
            call_user_func($callback, $item);
        }
    }
}

// Anonymous function
$callback = function(Item $item) {
    echo 'Additional step ...';
};

$processor = new Processor();
$processor->registerCallback($callback);
$processor->process(new Item());
#+end_src
* Object Tools
** PHP and Packages
