programming/book/php_objects_patterns_and_practice.html

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Working with Interceptors</h3>
<div class="outline-text-3" id="text-3-5">
<p>
<code>__call()</code> method can be useful for delegation - the mechanism by which one object passes method invocations on to a second. With inheritance the relationship between child and parent is fixed, the ability to switch the receiving object at runtime means that <span class="underline">delegation can be more flexible than inheritance</span>.
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Person</span> {
    <span class="org-keyword">private</span> $<span class="org-variable-name">writer</span>;
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__construct</span>(<span class="org-type">PersonWriter</span> $<span class="org-variable-name">writer</span>) {
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">writer</span> = $<span class="org-variable-name">writer</span>;
    }
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__call</span>(<span class="org-type">string</span> $<span class="org-variable-name">method</span>, <span class="org-type">array</span> $<span class="org-variable-name">args</span>) {
        <span class="org-keyword">if</span> (<span class="org-function-name">method_exists</span>($<span class="org-constant">this</span>-&gt;<span class="org-variable-name">writer</span>, $<span class="org-variable-name">method</span>)) {
            $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">writer</span>-&gt;<span class="org-function-name">$method</span>($<span class="org-constant">this</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">Delegate to writer</span>
        }
    }
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">getName</span>(): <span class="org-warning">string</span> {
        <span class="org-keyword">return</span> <span class="org-string">'Foo Bar'</span>;
    }
}

<span class="org-keyword">class</span> <span class="org-type">PersonWriter</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">writeName</span>(<span class="org-type">Person</span> $<span class="org-variable-name">person</span>) {
        <span class="org-keyword">echo</span> <span class="org-string">'Name: '</span> . $<span class="org-variable-name">person</span>-&gt;<span class="org-function-name">getName</span>() . <span class="org-string">"\n"</span>;
    }
}

$<span class="org-variable-name">writer</span> = <span class="org-keyword">new</span> <span class="org-type">PersonWriter</span>();
$<span class="org-variable-name">person</span> = <span class="org-keyword">new</span> <span class="org-type">Person</span>($<span class="org-variable-name">writer</span>);
$<span class="org-variable-name">person</span>-&gt;<span class="org-function-name">writeName</span>();
</pre>
</div>

<p>
Although automated delegation can save a lot of legwork, there can be a cost in clarity. Rely too much on delegation, you present the world with a dynamic interface that resists reflection. The logic that governs the interaction between a delegating class and its target can be obscure - buried in methods like <code>__call()</code> rather than signaled up front by inheritance relationships or method type hints.
</p>

<p>
<code>__get()</code> and <code>__set()</code> interceptor methods can also be used to manage composite properties.
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-preprocessor">&lt;?php</span>
<span class="org-keyword">class</span> <span class="org-type">Person</span> {
    <span class="org-keyword">private</span> $<span class="org-variable-name">firstName</span>;
    <span class="org-keyword">private</span> $<span class="org-variable-name">lastName</span>;
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__construct</span>(<span class="org-type">string</span> $<span class="org-variable-name">maybeFirst</span>, <span class="org-type">string</span> $<span class="org-variable-name">maybeLast</span> = <span class="org-constant">null</span>) {
        <span class="org-keyword">if</span> ($<span class="org-variable-name">maybeLast</span> === <span class="org-constant">null</span>) {
            $<span class="org-constant">this</span>-<span class="org-constant">&gt;</span><span class="org-variable-name">fullName</span> = $<span class="org-variable-name">maybeFirst</span>;
        } <span class="org-keyword">else</span> {
            $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">firstName</span> = $<span class="org-variable-name">maybeFirst</span>;
            $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">lastName</span> = $<span class="org-variable-name">maybeLast</span>;
        }
    }
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__set</span>(<span class="org-type">string</span> $<span class="org-variable-name">property</span>, <span class="org-type">string</span> $<span class="org-variable-name">value</span>) {
        <span class="org-keyword">if</span> ($<span class="org-variable-name">property</span> === <span class="org-string">'fullName'</span>) {
            $<span class="org-variable-name">name</span> = <span class="org-function-name">explode</span>(<span class="org-string">' '</span>, $<span class="org-variable-name">value</span>);
            <span class="org-keyword">if</span> (<span class="org-function-name">count</span>($<span class="org-variable-name">name</span>) &gt; <span class="org-default">1</span>) {
                $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">firstName</span> = <span class="org-function-name">array_shift</span>($<span class="org-variable-name">name</span>);
                $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">lastName</span> = <span class="org-function-name">implode</span>(<span class="org-string">' '</span>, $<span class="org-variable-name">name</span>);
            } <span class="org-keyword">else</span> {
                <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">Exception</span>(<span class="org-string">'Wrong name:'</span> . $<span class="org-variable-name">value</span>);   
            }
        }
    }
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__get</span>(<span class="org-type">string</span> $<span class="org-variable-name">property</span>) {
        <span class="org-keyword">if</span> ($<span class="org-variable-name">property</span> === <span class="org-string">'fullName'</span>) {
            <span class="org-keyword">return</span> $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">firstName</span> . <span class="org-string">' '</span> . $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">lastName</span>;
        }
    }
}

$<span class="org-variable-name">a</span> = <span class="org-keyword">new</span> <span class="org-type">Person</span>(<span class="org-string">'Foo'</span>, <span class="org-string">'Bar'</span>);
<span class="org-keyword">echo</span> $<span class="org-variable-name">a</span>-&gt;<span class="org-variable-name">fullName</span>;
$<span class="org-variable-name">b</span> = <span class="org-keyword">new</span> <span class="org-type">Person</span>(<span class="org-string">'Foo Bar'</span>);
<span class="org-keyword">echo</span> $<span class="org-variable-name">b</span>-&gt;<span class="org-variable-name">fullName</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Callbacks, Anonymous Functions, and Closures</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Adding many incidental tasks to a method will overwhelm its core responsibility. Callbacks allow plugging functionality into a component at runtime that is not directly related to that component's core task. By making a component callback aware, client code will have the power to extend core code in contexts you don't yet know about.
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Item</span> {}

<span class="org-keyword">class</span> <span class="org-type">Processor</span> {
    <span class="org-keyword">private</span> $<span class="org-variable-name">callbacks</span>;
    <span class="org-comment-delimiter">// </span><span class="org-comment">Register callbacks</span>
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">registerCallback</span>(<span class="org-type">callable</span> $<span class="org-variable-name">callback</span>) {
        <span class="org-keyword">if</span> (!<span class="org-function-name">is_callable</span>($<span class="org-variable-name">callback</span>)) {
            <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">Exception</span>(<span class="org-string">'Callback is not callable'</span>);
        }
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">callbacks</span>[] = $<span class="org-variable-name">callback</span>;
    }
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">process</span>(<span class="org-type">Item</span> $<span class="org-variable-name">item</span>) {
        <span class="org-keyword">echo</span> <span class="org-string">'Processing ...'</span>;
        <span class="org-comment-delimiter">// </span><span class="org-comment">Invoke callbacks</span>
        <span class="org-keyword">foreach</span> ($<span class="org-constant">this</span>-&gt;<span class="org-variable-name">callbacks</span> <span class="org-keyword">as</span> <span class="org-function-name">$callback</span>) {
            <span class="org-function-name">call_user_func</span>($<span class="org-variable-name">callback</span>, $<span class="org-variable-name">item</span>);
        }
    }
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Anonymous function</span>
$<span class="org-variable-name">callback</span> = <span class="org-keyword">function</span>(<span class="org-type">Item</span> $<span class="org-variable-name">item</span>) {
    <span class="org-keyword">echo</span> <span class="org-string">'Additional step ...'</span>;
};

$<span class="org-variable-name">processor</span> = <span class="org-keyword">new</span> <span class="org-type">Processor</span>();
$<span class="org-variable-name">processor</span>-&gt;<span class="org-function-name">registerCallback</span>($<span class="org-variable-name">callback</span>);
$<span class="org-variable-name">processor</span>-&gt;<span class="org-function-name">process</span>(<span class="org-keyword">new</span> <span class="org-type">Item</span>());
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Object Tools</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> PHP and Packages</h3>
