programming/book/php_objects_patterns_and_practice.org
*** PHP Packages and Namespaces

Until PHP 5.3, developers were forced to name their files in a global context.

#+caption: The most damaging problem was the possibility of naming collisions.
#+begin_src php
// Foo.php
class Dummy {}
// Bar.php
include 'Foo.php';
class Dummy {} // Fatal error:  Cannot declare class Dummy ...
#+end_src

#+caption: A conventional workaround was to prepend package names to class names.
#+begin_src php
// Foo.php
class Foo_Dummy {}
// Bar.php
include 'Foo.php';
class Bar_Dummy {}
#+end_src

However, as class names grew longer and longer, it resulted in issues with code readability.

-----

A domain name is unique to its owner, this is a trick that Java developers typically use for their package names. They invert domain names so that they run from the most generic to the most specific.
*** Include Paths

#+begin_src php
require_once(__DIR__ . '/../useful/Outputter.php');
#+end_src

The relationship between files is hardcoded. There must always be a =useful= directory alongside the calling class's containing directory.

#+begin_src php
require_once('../../projectlib/business/User.php');
#+end_src

The path is not relative to the file that contains this =require_once= statement, but to a configured calling context.

#+begin_src php
require_once('/home/john/projectlib/business/User.php');
#+end_src

Freeze the library file into a particular context. It will work for a single instance, but it makes libraries hard to relocate and impractical to share among projects. To install the project on a new server, all =require= statements will need changing to account for a new file path.

If must manually include files, the neatest approach is to decouple the invoking code from the library =business/User.php=.

#+caption: This can be achieved by adding the directory to =include_path=.
#+begin_src sh
include_path = ".:/usr/local/lib/php-libraries"
#+end_src

#+caption: Or with Apache, set =include_path= in =httpd.conf= or per-directory configuration file =.htaccess=.
#+begin_src sh
php_value include_path value .:/usr/local/lib/php-libraries
#+end_src 

*** Autoload

Although it's neat to use =require_once= in conjunction with =include_path=, many developers are doing away with require statements altogether at a high level and relying instead on autoload.

To use autoload, classes should be organized so that each sits in its own file. And each class file should bear a fixed relationship to the name of the class it contains.

-----

=spl_autoload_register()= stacks the autoload functions. When PHP encounters an unknown class, it will invoke the autoload functions in turn, stopping when instantiation is possible, or when the all options have been exhausted. There is obviously an overhead to this kind of stacking. It is still supported because components in large systems and in third-party libraries may need to register their own autoload mechanisms. Stacking allows multiple parts of a system to register autoload strategies independently, without overwriting one another.
** The Class and Object Functions

#+caption: PHP allows you to use strings to refer to classes dynamically:
#+begin_src php
class Foo {}
$class = 'Foo';
$foo = new $class();
#+end_src
* Objects and Design
** Object-Oriented and Procedural Programming

One core difference between object-oriented and procedural code can be found in the way that responsibility is distributed.

In procedure programming, the controlling code tends to take responsibility for handling differing conditions. This top-down control can result in the development of duplications and dependencies across a project. Object-oriented code tries to minimize these dependencies by _moving responsibility for handling tasks away from client code and toward the objects_.

*** Responsibility

#+caption: Placing a static method for generating child objects in the parent class.
#+begin_src php
abstract class ParamHandler {
    public static function getInstance(string $filename) {
        if (preg_match("/\.xml$/i", $filename)) {
            return new XmlParamHandler($filename);
        }
        return new TextParamHandler($filename);
    }
    abstract public function write();
    abstract public function read();
}
class TextParamHandler extends ParamHandler {...}
class XmlParamHandler extends ParamHandler {...}
#+end_src

The choice about file format is made in the static method, which tests the file extension only once. The client code takes no responsibility for implementation. It uses the provided object with no knowledge of, or interest in, the particular subclass it belongs to. Because responsibility for implementation lies with the objects and not with the client code, it would be easy to switch in support for new formats transparently.

This pattern is convenient but has its consequences. To handle another format, being the maintainer of =ParamHandler=, you can amend the =getInstance()= method. But being a client coder, you face the prospect of having to reapply the patch every time the package is reinstalled.

*** Cohesion

Cohesion is the extent to which _proximate procedures are related to one another_. Ideally, components should be created to share a clear responsibility. If related routines are spread widely, it will be harder to maintain as you have to hunt around to make changes.

