programming/book/php_objects_patterns_and_practice.html
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> PHP Packages and Namespaces</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Until PHP 5.3, developers were forced to name their files in a global context.
</p>

<div class="org-src-container">
<label class="org-src-name">The most damaging problem was the possibility of naming collisions.</label>
<pre class="src src-php"><span class="org-comment-delimiter">// </span><span class="org-comment">Foo.php</span>
<span class="org-keyword">class</span> <span class="org-type">Dummy</span> {}
<span class="org-comment-delimiter">// </span><span class="org-comment">Bar.php</span>
<span class="org-keyword">include</span> <span class="org-string">'Foo.php'</span>;
<span class="org-keyword">class</span> <span class="org-type">Dummy</span> {} <span class="org-comment-delimiter">// </span><span class="org-comment">Fatal error:  Cannot declare class Dummy ...</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">A conventional workaround was to prepend package names to class names.</label>
<pre class="src src-php"><span class="org-comment-delimiter">// </span><span class="org-comment">Foo.php</span>
<span class="org-keyword">class</span> <span class="org-type">Foo_Dummy</span> {}
<span class="org-comment-delimiter">// </span><span class="org-comment">Bar.php</span>
<span class="org-keyword">include</span> <span class="org-string">'Foo.php'</span>;
<span class="org-keyword">class</span> <span class="org-type">Bar_Dummy</span> {}
</pre>
</div>

<p>
However, as class names grew longer and longer, it resulted in issues with code readability.
</p>

<hr  />

<p>
A domain name is unique to its owner, this is a trick that Java developers typically use for their package names. They invert domain names so that they run from the most generic to the most specific.
</p>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Include Paths</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">require_once</span>(<span class="org-constant">__DIR__</span> . <span class="org-string">'/../useful/Outputter.php'</span>);
</pre>
</div>

<p>
The relationship between files is hardcoded. There must always be a <code>useful</code> directory alongside the calling class's containing directory.
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">require_once</span>(<span class="org-string">'../../projectlib/business/User.php'</span>);
</pre>
</div>

<p>
The path is not relative to the file that contains this <code>require_once</code> statement, but to a configured calling context.
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">require_once</span>(<span class="org-string">'/home/john/projectlib/business/User.php'</span>);
</pre>
</div>

<p>
Freeze the library file into a particular context. It will work for a single instance, but it makes libraries hard to relocate and impractical to share among projects. To install the project on a new server, all <code>require</code> statements will need changing to account for a new file path.
</p>

<p>
If must manually include files, the neatest approach is to decouple the invoking code from the library <code>business/User.php</code>.
</p>

<div class="org-src-container">
<label class="org-src-name">This can be achieved by adding the directory to <code>include_path</code>.</label>
<pre class="src src-sh">include_path = <span class="org-string">".:/usr/local/lib/php-libraries"</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">Or with Apache, set <code>include_path</code> in <code>httpd.conf</code> or per-directory configuration file <code>.htaccess</code>.</label>
<pre class="src src-sh">php_value include_path value .:/usr/local/lib/php-libraries
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> Autoload</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Although it's neat to use <code>require_once</code> in conjunction with <code>include_path</code>, many developers are doing away with require statements altogether at a high level and relying instead on autoload.
</p>

<p>
To use autoload, classes should be organized so that each sits in its own file. And each class file should bear a fixed relationship to the name of the class it contains.
</p>

<hr  />

<p>
<code>spl_autoload_register()</code> stacks the autoload functions. When PHP encounters an unknown class, it will invoke the autoload functions in turn, stopping when instantiation is possible, or when the all options have been exhausted. There is obviously an overhead to this kind of stacking. It is still supported because components in large systems and in third-party libraries may need to register their own autoload mechanisms. Stacking allows multiple parts of a system to register autoload strategies independently, without overwriting one another.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> The Class and Object Functions</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<label class="org-src-name">PHP allows you to use strings to refer to classes dynamically:</label>
<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {}
$<span class="org-variable-name">class</span> = <span class="org-string">'Foo'</span>;
$<span class="org-variable-name">foo</span> = <span class="org-keyword">new</span> $<span class="org-type">class</span>();
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Objects and Design</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Object-Oriented and Procedural Programming</h3>
<div class="outline-text-3" id="text-5-1">
<p>
One core difference between object-oriented and procedural code can be found in the way that responsibility is distributed.
</p>

<p>
In procedure programming, the controlling code tends to take responsibility for handling differing conditions. This top-down control can result in the development of duplications and dependencies across a project. Object-oriented code tries to minimize these dependencies by <span class="underline">moving responsibility for handling tasks away from client code and toward the objects</span>.
</p>
</div>

<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Responsibility</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<label class="org-src-name">Placing a static method for generating child objects in the parent class.</label>
<pre class="src src-php"><span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">ParamHandler</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">getInstance</span>(<span class="org-type">string</span> $<span class="org-variable-name">filename</span>) {
        <span class="org-keyword">if</span> (<span class="org-function-name">preg_match</span>(<span class="org-string">"/\.xml$/i"</span>, $<span class="org-variable-name">filename</span>)) {
            <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">XmlParamHandler</span>($<span class="org-variable-name">filename</span>);
        }
        <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">TextParamHandler</span>($<span class="org-variable-name">filename</span>);
    }
    <span class="org-keyword">abstract</span> <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">write</span>();
    <span class="org-keyword">abstract</span> <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">read</span>();
}
<span class="org-keyword">class</span> <span class="org-type">TextParamHandler</span> <span class="org-keyword">extends</span> <span class="org-type">ParamHandler</span> {...}
<span class="org-keyword">class</span> <span class="org-type">XmlParamHandler</span> <span class="org-keyword">extends</span> <span class="org-type">ParamHandler</span> {...}
</pre>
</div>

<p>
The choice about file format is made in the static method, which tests the file extension only once. The client code takes no responsibility for implementation. It uses the provided object with no knowledge of, or interest in, the particular subclass it belongs to. Because responsibility for implementation lies with the objects and not with the client code, it would be easy to switch in support for new formats transparently.
</p>

<p>
This pattern is convenient but has its consequences. To handle another format, being the maintainer of <code>ParamHandler</code>, you can amend the <code>getInstance()</code> method. But being a client coder, you face the prospect of having to reapply the patch every time the package is reinstalled.
</p>
</div>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> Cohesion</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
Cohesion is the extent to which <span class="underline">proximate procedures are related to one another</span>. Ideally, components should be created to share a clear responsibility. If related routines are spread widely, it will be harder to maintain as you have to hunt around to make changes.
</p>
</div>
</div>
