programming/book/php_objects_patterns_and_practice.org
*** Coupling

Tight coupling occurs when discrete parts of a system's code are tightly bound up with one another so that a _change in one part necessitates changes in the others_.

*** Orthogonality

The combination of components with tightly defined responsibilities that are also independent from the wider system is sometimes referred to as orthogonality. Orthogonality promotes reuse in that components can be plugged into new systems without needing any special configuration. Such components will have clear inputs and outputs, independent of any wider context.

** Choosing Your Classes

It can seem straightforward when you are modeling the real world. This is not a bad starting point, but it does have its dangers. You may find it bloating as ongoing development and requirement changes call for it to do more and more things.

#+begin_quote
A =ShopProduct= class manages product data. It may provide a mechanism for outputting summary information for invoices and delivery notes with a =write()= method. But when the client asks for product summaries in different formats, there are 2 options: create =writeXML()= and =writeHTML()= methods in addition, or add conditional code to =write()= to output different formats, according to an option flag. Either way, the problem here is that the =ShopProduct= class is now trying to do too much.
#+end_quote

The best approach is to think of a class as having a primary responsibility and to make that responsibility as singular and focused as possible. Describe a class's responsibility in 25 words or less, rarely using the words "and" or "or". 

** Polymorphism

Polymorphism, or class switching, is the maintenance of _multiple implementations behind a common interface_.

The need for polymorphism is often signaled by the presence of extensive conditional statements. Polymorphism doesn't banish conditionals. It tends to centralize the conditional code into one place.

** Encapsulation

Encapsulation means the _hiding of data and functionality from client_.

The interface is what matters, not the mechanisms working beneath it. And the objective should be to make each part as independent as possible from its peers. 
** Forget How to Do It

At the design stage, empty your head of procedures and mechanisms. _Think only about the key participants of the system: the types it will need and their interfaces._ Let the structures and relationships in the code lead you. The implementation will fall into place easily behind a well-defined interface.

To emphasize interface, think in terms of abstract base classes rather than concrete children. It is this responsibility that is important about the type, not the actual persistence medium or the means of storing and retrieving data.
** Four Signposts
*** Code Duplication

Duplication generally means tight coupling. If change something fundamental about one routine, will the similar routines need amendment? If this is the case, they probably belong in the same class.

*** The Class Who Knew Too Much

limit a class's knowledge of its context. By using a global variable, or by giving a class any kind of knowledge about its wider domain, you anchor it into its context, making it less reusable and dependent on code beyond its control.
** The UML [Skipped]
