programming/book/php_objects_patterns_and_practice.html
<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> Coupling</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
Tight coupling occurs when discrete parts of a system's code are tightly bound up with one another so that a <span class="underline">change in one part necessitates changes in the others</span>.
</p>
</div>
</div>
<div id="outline-container-sec-5-1-4" class="outline-4">
<h4 id="sec-5-1-4"><span class="section-number-4">5.1.4</span> Orthogonality</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
The combination of components with tightly defined responsibilities that are also independent from the wider system is sometimes referred to as orthogonality. Orthogonality promotes reuse in that components can be plugged into new systems without needing any special configuration. Such components will have clear inputs and outputs, independent of any wider context.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Choosing Your Classes</h3>
<div class="outline-text-3" id="text-5-2">
<p>
It can seem straightforward when you are modeling the real world. This is not a bad starting point, but it does have its dangers. You may find it bloating as ongoing development and requirement changes call for it to do more and more things.
</p>

<div class="org-quote-container">
<blockquote>
<p>
A <code>ShopProduct</code> class manages product data. It may provide a mechanism for outputting summary information for invoices and delivery notes with a <code>write()</code> method. But when the client asks for product summaries in different formats, there are 2 options: create <code>writeXML()</code> and <code>writeHTML()</code> methods in addition, or add conditional code to <code>write()</code> to output different formats, according to an option flag. Either way, the problem here is that the <code>ShopProduct</code> class is now trying to do too much.
</p>
</blockquote>
</div>

<p>
The best approach is to think of a class as having a primary responsibility and to make that responsibility as singular and focused as possible. Describe a class's responsibility in 25 words or less, rarely using the words "and" or "or". 
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Polymorphism</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Polymorphism, or class switching, is the maintenance of <span class="underline">multiple implementations behind a common interface</span>.
</p>

<p>
The need for polymorphism is often signaled by the presence of extensive conditional statements. Polymorphism doesn't banish conditionals. It tends to centralize the conditional code into one place.
</p>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Encapsulation</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Encapsulation means the <span class="underline">hiding of data and functionality from client</span>.
</p>

<p>
The interface is what matters, not the mechanisms working beneath it. And the objective should be to make each part as independent as possible from its peers. 
</p>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Forget How to Do It</h3>
<div class="outline-text-3" id="text-5-5">
<p>
At the design stage, empty your head of procedures and mechanisms. <span class="underline">Think only about the key participants of the system: the types it will need and their interfaces.</span> Let the structures and relationships in the code lead you. The implementation will fall into place easily behind a well-defined interface.
</p>

<p>
To emphasize interface, think in terms of abstract base classes rather than concrete children. It is this responsibility that is important about the type, not the actual persistence medium or the means of storing and retrieving data.
</p>
</div>
</div>

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> Four Signposts</h3>
<div class="outline-text-3" id="text-5-6">
</div><div id="outline-container-sec-5-6-1" class="outline-4">
<h4 id="sec-5-6-1"><span class="section-number-4">5.6.1</span> Code Duplication</h4>
<div class="outline-text-4" id="text-5-6-1">
<p>
Duplication generally means tight coupling. If change something fundamental about one routine, will the similar routines need amendment? If this is the case, they probably belong in the same class.
</p>
</div>
</div>
<div id="outline-container-sec-5-6-2" class="outline-4">
<h4 id="sec-5-6-2"><span class="section-number-4">5.6.2</span> The Class Who Knew Too Much</h4>
<div class="outline-text-4" id="text-5-6-2">
<p>
limit a class's knowledge of its context. By using a global variable, or by giving a class any kind of knowledge about its wider domain, you anchor it into its context, making it less reusable and dependent on code beyond its control.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> The UML [Skipped]</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-09-16 Sat 19:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
